
#### Terraform Plan
<details>
<summary>Expand</summary>

```
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/web-timovink/runs/run-XMsmQeAFSmYy5EHZ

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
data.aws_acm_certificate.this: Reading...
data.aws_acm_certificate.this: Read complete after 0s [id=arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1]
aws_cloudfront_function.spa_redirect: Refreshing state... [id=tv-personalsite-sparedirect]
aws_cloudfront_origin_access_identity.this: Refreshing state... [id=E28YB31OSATPHN]
data.aws_route53_zone.this: Reading...
aws_s3_bucket.static_assets: Refreshing state... [id=tv-personalsite]
data.aws_route53_zone.this: Read complete after 1s [id=Z09071302Y5GD83DY6NXW]
data.aws_iam_policy_document.static_assets: Reading...
aws_s3_bucket_server_side_encryption_configuration.static_assets: Refreshing state... [id=tv-personalsite]
data.aws_iam_policy_document.static_assets: Read complete after 0s [id=1217024775]
aws_s3_bucket_policy.static_assets: Refreshing state... [id=tv-personalsite]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.this will be created
  + resource "aws_cloudfront_distribution" "this" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Project" = "tv-personalsite"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "default"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::920122847127:function/tv-personalsite-sparedirect"
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "tv-personalsite.s3.us-west-2.amazonaws.com"
          + origin_id           = "default"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E28YB31OSATPHN"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.dev"
      + type            = "A"
      + zone_id         = "Z09071302Y5GD83DY6NXW"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>